tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "ngrok/ngrok"
tap "planetscale/tap"
tap "stripe/stripe-cli"
tap "supabase/tap"
brew "fd"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "lcdf-typetools"
brew "mas"
brew "mysql"
brew "mysql-client"
brew "neovim"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tmux"
brew "jesseduffield/lazygit/lazygit"
brew "planetscale/tap/pscale"
brew "stripe/stripe-cli/stripe"
brew "supabase/tap/supabase"
cask "alacritty"
cask "font-fira-code-nerd-font"
cask "iterm2"
cask "linearmouse"
cask "ngrok"
cask "raycast"
